In [1]:
import pandas as pd

In [3]:
people = {
    "이름" : ["오공","지터","오반"],
    "성"   : ["손", "베", "손"],
    "이메일" : ["gks@gmail.com","jtv@gmail.com","ghs@gmail.com",]
}

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   이름  성            이메일
0  오공  손  gks@gmail.com
1  지터  베  jtv@gmail.com
2  오반  손  ghs@gmail.com

In [7]:
df.columns

Index(['이름', '성', '이메일'], dtype='object')

칼럼 이름을 변경해보자

In [8]:
df.columns = ['first_name','last_name','email']

In [9]:
df

  first_name last_name          email
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

In [11]:
nums = [x for x in range(1,10)]

In [12]:
nums

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [13]:
n1 =3
n2 = 5
n1, n2 = n2, n1

In [16]:
n1,n2

(5, 3)

In [17]:
"first_name".upper()

'FIRST_NAME'

In [18]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [21]:
df.columns = [x.upper() for x in df.columns]

In [22]:
df

  FIRST_NAME LAST_NAME          EMAIL
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

In [23]:
"Hello World".replace("Hello","안녕 ㅋㅋ")

'안녕 ㅋㅋ World'

칼럼 이름의 "_" 를 " "공백으로 변경해보자 ~

In [24]:
df.columns = [x.replace("_"," ") for x in df.columns]

In [25]:
df

  FIRST NAME LAST NAME          EMAIL
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

원본의 칼럼명을 변경하고싶다면 ? 다음과 같이

In [27]:
df.columns = [x.replace("_"," ") for x in df.columns]

In [28]:
df

  FIRST NAME LAST NAME          EMAIL
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com

칼럼 이름을 소문자로 변경하라. lower()

In [29]:
df.columns = [x.lower() for x in df.columns]

In [30]:
df

  first name last name          email
0         오공         손  gks@gmail.com
1         지터         베  jtv@gmail.com
2         오반         손  ghs@gmail.com